{"url":{"0":"https:\/\/www.linkedin.com\/organization-guest\/school\/ebs-paris\/?_l=en"},"name":{"0":"EBS Paris - European Business School"},"founded":{"0":"1967"},"sphere":{"0":"Education Administration Programs"},"followers":{"0":"14489"},"logo":{"0":"https:\/\/media.licdn.com\/dms\/image\/C4E0BAQELOBSyI4OylA\/company-logo_200_200\/0\/1656664732267?e=2147483647&v=beta&t=TqIR6V1OXM07g11nUtGmHcy53L1gc_-QtItJWu5TKl8"},"image":{"0":"https:\/\/media.licdn.com\/dms\/image\/D4E1BAQGBE08fEIFCLQ\/company-background_10000\/0\/1656664928371?e=1681999200&v=beta&t=NeS5YllAxbqTTHjgorQyhL6V9BrKEOaFOc2V6BMhmQY"},"employeesAmountInLinkedin":{"0":"122"},"about":{"0":"A pioneering model since 1967, EBS Paris is a post-baccalaureate Grande Ecole of Management delivering a targeted Bac+5 degree Master's degree recognized by the State.\n\n👉 Our students are placed at the heart of an education based on a solid and pragmatic academic base. We offer a professional and international course adapted to everyone, which trains managers ready to meet the needs of the companies of tomorrow.\nWe support each student and help them grow individually. We believe in the power of strong personalities and we are here to help them find a path that will allow them to reveal their potential.\n\n💙 Choosing EBS Paris means choosing a school on a human scale that gives great importance to its students.\n\n🎓 EBS Paris provides benchmarks for building, and allows you to create a stimulating and inspiring network, a network that now has more than 9000 Alumni, spread all over the world.\n\n🌳 EBS Paris is a school of the Accelis Education Group."},"website":{"0":"ebs-paris.fr"},"locations":{"0":["10, Rue Sextius Michel, Paris, Île-de-France 75015, FR"]},"employees":{"0":[{"img":"https:\/\/media.licdn.com\/dms\/image\/C4D03AQH8WJdQeOfttw\/profile-displayphoto-shrink_100_100\/0\/1585922921718?e=1686787200&v=beta&t=ndKdniLdX1CpHIGafSex0T9bu20elAYwU-B4UuC17vQ","title":"Patrick Giry-Deloison","subtitle":"Operational Consultant, Business Coach, Professor of Business & Marketing, Business Angel, Horse Rider"},{"img":"https:\/\/media.licdn.com\/dms\/image\/C4E03AQFMZxG9rD51ww\/profile-displayphoto-shrink_100_100\/0\/1614680955896?e=1686787200&v=beta&t=ReKB3UG5rRM7uUEgFd-2AtGVvmUY7ZgrWiyvXMaO-98","title":"David-Olivier Bouchez"},{"img":"https:\/\/media.licdn.com\/dms\/image\/C4E03AQFacXu-EhmRCg\/profile-displayphoto-shrink_100_100\/0\/1599292165467?e=1686787200&v=beta&t=HfBxSTKqjmlmSs1hVVem5Hy-fzNniFwLxzj8j7JIhvo","title":"Cyril Garnier"},{"img":"https:\/\/media.licdn.com\/dms\/image\/C4E03AQG4za4E3N8lIg\/profile-displayphoto-shrink_100_100\/0\/1516313677288?e=1686787200&v=beta&t=l6OlM72_BK6lECK5Bl4W4pzsWoZCvbzg7sakQLS8xU8","title":"Chris Maupetit"}]},"updates":{"0":[{"likes_count":0,"comments_count":0},{"time":"1w","text":"DIPLOMATION PROMOTION 2022 | C'est avec une grande émotion que nous avons assisté à la cérémonie de remise des diplômes de la promotion EBS 2022 samedi dernier. Ce fut une matinée mémorable remplie de fierté et de joie pour tous les diplômés, leurs familles et toute l'équipe d'EBS ✨ Chers étudiants, nous sommes convaincus que vous possédez désormais toutes les armes pour surmonter tous les obstacles et mener une carrière exceptionnelle. Nous vous souhaitons beaucoup de succès et avons hâte de vous voir réaliser vos rêves 👏 Bienvenue désormais dans la grande communauté des Alumni EBS 🎓 EBS Paris Alumni Khalil KHATER Jean-Marie Kouyoumji Cyril Garnier Inès Khater Marc du Peloux, PhD David Ngonga martine DEPARIS Nathalie Thévenot Virginie JULIEN Michel Motte Giorgia Di Martino 📷 : Cyril Garnier #ebsparis #ebsparisfamily #ebsalumni","likes_count":221,"comments_count":1},{"time":"3w","text":"🌍 INTERNATIONAL | L'année à l'international approche à grands pas pour nos étudiants en 2ème année ! Après une cérémonie d'affectation des destinations supervisée par l'équipe des #relationsinternationales, nos étudiants savent enfin où ils passeront leur année ! New York, Lisbonne, Bangkok... Autant de destinations magiques où ils pourront s'épanouir aussi bien professionnellement que personnellement ! Bravo à tous nos étudiants et bonne chance pour la suite 😍 #international #newadventure #ebsfamily","likes_count":119,"comments_count":2},{"likes_count":0,"comments_count":0},{"time":"1mo","text":"🎸 VIE ASSO' | Nous sommes très heureux de vous annoncer que nous avons officiellement lancé notre 1er Conseil de la Vie Associative (CVA). 🏋♀️ Le CVA est un espace de propositions et un laboratoire d'idées dédié à nos présidents d'asso' et à nos responsables Vie Associative dans le but de renforcer la dynamique de l'ensemble des asso' de l'EBS. L'objectif? ✅ Faire émerger de nouveaux projets et bénéficier des idées et insights de leurs pairs ✅ Assurer la pérennité financière des asso' et assurer la mise en place de budgets associatifs ✅ Nourrir la vie de l'école, renforcer sa visibilité et inviter de nouveaux étudiants à oser l'aventure passionnante de la vie associative ! Bravo à tous pour cette belle initiative ! #vieassociative #EBScommunity #thebestisyettocome","likes_count":68,"comments_count":1},{"time":"2mo","text":"🎒 ALUMNI | Encore étudiant à l'EBS Paris, Damien Morin monte SAVE en 2013, spécialiste de la réparation de smartphones et s’impose en 2 ans sur la scène de la tech parisienne. Levée de fonds de 15 millions d'euros, recrutement par dizaines et ouvertures de filiales à l’étranger, Save connaît un véritable succès jusqu'en 2016 avant d'être placée en redressement judiciaire. Quelques mois plus tard, SAVE est racheté par le groupe REMADE. Mais Damien Morin ne s’arrêtera pas là. Il se remet en selle et quelques mois plus tard, il fonde mobile.club, société spécialisée dans la location de téléphones. Aujourd’hui, il fait partie des entrepreneurs les plus inspirants de sa génération et a récemment convaincu 130 business angels de le suivre dans sa nouvelle aventure… L'EBS Paris est fière de compter Damien Morin parmi ses Alumni ! Découvrez son ITV complète 👇","likes_count":175,"comments_count":2},{"likes_count":0,"comments_count":0},{"time":"2mo","text":"🤝Nous sommes très heureux de vous annoncer que le Bureau des Alumni, appelé EPNA, EBS Paris Network Association, a été recréé par 4 de nos fidèles alumni après plusieurs années d'interruption 👥 Une force supplémentaire pour notre école qui a d'ores et déjà embrassé la voie du renouveau et qui peut se rassurer de compter sur un nouveau Bureau plus impliqué que jamais ! 🚀 Quelques mots du Président de l'association des anciens Nicolas Benzimra envers le réseau des Alumni : \"L'année qui vient de débuter est celle de l'innovation, de la réinvention et de l'épanouissement. Nous avons recréé votre bureau des anciens élèves afin d'accompagner la nouvelle stratégie de l'école. Un réseau de plus de 10 000 anciens Ebésiens sommeille sous nos yeux. Un trésor d'opportunités et de connections précieuses. La crise du COVID a bouleversé la vie de l’Ecole et de ses parties prenantes, privant ainsi les élèves et les anciens élèves de l'EBS de l'opportunité de se connecter, de partager leurs expériences et de réaliser leur potentiel. C’est pourquoi nous nous engageons à réactiver ce réseau qui vous appartient, en prenant la responsabilité de le rendre plus actif et plus utile pour tous les membres de la communauté EBS Paris.\" Grande nouvelle pour l'EBS et pour ses Alumni. The best is yet to come ! EBS Paris Alumni Cyril Garnier Léo Guitton Romain Altazin Nicolas Benzimra Anne Buffetaud Khalil KHATER Michel Motte","likes_count":170,"comments_count":10},{"likes_count":0,"comments_count":0},{"time":"3mo","text":"[#INCENTIVE BARCELONE] 🚂 Le week-end dernier, nos chers ambassadeurs se sont rendus à Barcelone dans le cadre d'un séminaire Team Building inoubliable. 🗓 🏆 Durant deux jours, nos Ambassadeurs ont été mis à l'épreuve autour d'ateliers ludiques et sportifs favorisant l'#entraide, la #cohésion et le #dépassement de soi. Concours de photos avec des inconnus, épreuve inspirée de l'émission \"The Voice\" en équipes, séance sportive matinale ainsi qu'exercices de prise de paroles ont rythmé ces deux jours forts en émotions. ils ont également eu l'occasion de visiter en exclusivité le futur Campus de l'EBS à Barcelone qui recevra des ebésiens dès la rentrée 2023. 🍻 Ce fût aussi et surtout l'occasion pour nos Ambassadeurs de découvrir ou redécouvrir les lieux magiques de Barcelone, les bars à tapas, l'ambiance à l'espagnol, et la joie partagée de se retrouver ensemble dans la ville généreuse de Barcelone ! Jean-Marie Kouyoumji Cyril Garnier Laura Nebot Gonzalez Pierre Frangieh Inès Khater Gaëlla BITEBODI #ebsambassadeurs #ebspirit #EBSFamily #teambuilding","likes_count":97,"comments_count":6}]},"show_more":{"0":[]},"affiliated":{"0":[]},"browse_jobs":{"0":[]},"timestamp":{"0":"2023-04-13T13:45:38.783Z"},"slogan":{"0":"Join the European Business School !"},"similarPages":{"0":[{"name":"Groupe GEMA","pageUrl":"https:\/\/fr.linkedin.com\/company\/groupe-gema?trk=similar-pages","activity":"Higher Education","location":"Boulogne-Billancourt, France"},{"name":"Ambassade de Mozambique en France","pageUrl":"https:\/\/fr.linkedin.com\/company\/ambassade-de-mozambique-en-france?trk=similar-pages","activity":"Government Administration","location":"Paris, Île-de-France"},{"name":"EBS Advisory","pageUrl":"https:\/\/za.linkedin.com\/company\/ebs-advisory?trk=similar-pages","activity":"Environmental Services","location":"Johannesburg, Gauteng"},{"name":"Ambassade des Océans","pageUrl":"https:\/\/fr.linkedin.com\/company\/ambassadeoceans?trk=similar-pages","activity":"Environmental Services","location":"Savigny, Normandie"},{"name":"Le Forum de l'Universel","pageUrl":"https:\/\/fr.linkedin.com\/company\/le-forum-de-l-universel?trk=similar-pages","activity":"Civic and Social Organizations"},{"name":"CNRS EDITIONS","pageUrl":"https:\/\/fr.linkedin.com\/company\/cnrs-editions?trk=similar-pages","activity":"Book and Periodical Publishing"},{"name":"Ambassade du Danemark: l'écosystème santé","pageUrl":"https:\/\/fr.linkedin.com\/company\/l%E2%80%99ambassade-du-danemark-la-sant%C3%A9?trk=similar-pages","activity":"Government Administration"},{"name":"Pandaloc","pageUrl":"https:\/\/fr.linkedin.com\/company\/pandaloc?trk=similar-pages","activity":"Real Estate"},{"name":"The TOP Tennessee - An International Business, Politics, and NGO Magazine and a Global Charity + HUB","pageUrl":"https:\/\/www.linkedin.com\/company\/the-top-tn-an-international-business-politics-and-ngo-magazine-and-a-global-initiative-with-hub?trk=similar-pages","activity":"Non-profit Organizations","location":"New York City, New York"},{"name":"Ambassade du Brésil à Paris - Embaixada do Brasil em Paris","pageUrl":"https:\/\/fr.linkedin.com\/company\/bresilenfrance?trk=similar-pages","activity":"Government Administration","location":"Paris, Île-de-France"}]},"Website":{"0":"ebs-paris.fr"},"Industries":{"0":"Education Administration Programs"},"Company size":{"0":"1,001-5,000 employees"},"Headquarters":{"0":"Paris, Île-de-France"},"Type":{"0":"Educational"},"Specialties":{"0":"Innovation et Management Entrepreneurial, Digital Business et E-Commerce, Marketing et Communication, Finance, Management du Luxe et de la Mode, Management des Systèmes d'Information, and Management des Affaires Internationales"}}