{"url":{"0":"https:\/\/www.linkedin.com\/organization-guest\/school\/icd-internationalbusinessschool\/?_l=en"},"name":{"0":"ICD Business School"},"founded":{"0":"1980"},"sphere":{"0":"Higher Education"},"followers":{"0":13842},"logo":{"0":"https:\/\/media.licdn.com\/dms\/image\/C4E0BAQFQBI8284On6w\/company-logo_200_200\/0\/1569925296545?e=2147483647&v=beta&t=fp1wX-Ang3uuqObztyNB-o0zHPzhHY1nb3BSnSA1pJs"},"image":{"0":"https:\/\/media.licdn.com\/dms\/image\/C4E1BAQE8RPCRnXqljA\/company-background_10000\/0\/1569925254973?e=1684846800&v=beta&t=qSeGwcdlaAwkzio3P0wMSGuKLNrQlCYi_vUEH7Xn8fs"},"employeesAmountInLinkedin":{"0":"243"},"about":{"0":"Depuis 1980, l’ICD, l’école du commerce et du marketing du Groupe IGS, se révèle pionnier dans la formation aux nouveaux domaines du commerce et du marketing, de l’internationalisation des cursus, et des nouvelles pédagogies mêlant la dimension professionnelle, personnelle et responsable.\nOffrir aux acteurs du monde de demain les clefs de la connaissance est un des engagements de l’école. En choisissant l’ICD, les étudiants sont accompagnés dans leur projet professionnel dès la première année et tout au long de leur vie professionnelle. L’école propose de nombreux cursus allant du bachelor au Programme Grande Ecole (grade de Master). Véritable école de commerce internationale, l’ICD intègre cette composante à plusieurs niveaux dans ses formations : échanges internationaux, doubles diplômes, cours en français...\n\nL’ICD est reconnue pour ses spécialisations en :\n\n-Commerce\n-Marketing\n-Business Development\n-Evènementiel\n\nŒuvrant depuis de nombreuses années dans l’enseignement supérieur, l’ICD fait évoluer ses cursus pour offrir une expérience pédagogique unique à ses étudiants. Ainsi, l’ICD a intégré à ses formations une dimension internationale forte qui permet à ses diplômés de se distinguer sur le marché de l’emploi."},"website":{"0":"http:\/\/www.icd-ecoles.com\/"},"locations":{"0":["12 rue alexandre parodi et 186 Route de Grenade, 31700 Blagnac, Paris et Toulouse, IDF et Occitanie 75010 et 31700, FR"]},"employees":{"0":[{"img":"https:\/\/media.licdn.com\/dms\/image\/C5603AQEESInSuJEFYA\/profile-displayphoto-shrink_100_100\/0\/1572474306269?e=1689811200&v=beta&t=XQgno7EcQ3r8hWNgflG75DfQ6yRu4B9M_lS05GMl-jY","title":"Christian Goglin, PhD","subtitle":"Associate Professor in Finance & AI and Head of C.E.D.I.A chez ICD Business School"},{"img":"https:\/\/media.licdn.com\/dms\/image\/C4E03AQHIUtqm4Oqr4Q\/profile-displayphoto-shrink_100_100\/0\/1629787850977?e=1689811200&v=beta&t=8WUGxMeqPiPLoOsqD4uuE9rbonk-Tf-dy31E6FUnU8M","title":"Gabriel DEUTOU, Ph.D. DTN Education","subtitle":"Expert in Higher Ed | EdTech Entrepreneur | MasterClass Lecturer"},{"img":"https:\/\/media.licdn.com\/dms\/image\/C4E03AQHKK1ltwpObeg\/profile-displayphoto-shrink_100_100\/0\/1551894757382?e=1689811200&v=beta&t=qDkxCilFZNUMA7J_yseNKeWWlKgcZaR4ldZEOxWpb58","title":"Eric Martel","subtitle":"Enseignant-chercheur chez ICD Business School \/ Responsable du Dpt IA & Data"},{"img":"https:\/\/media.licdn.com\/dms\/image\/D4E03AQHyEn2DKhyhuQ\/profile-displayphoto-shrink_100_100\/0\/1681371668444?e=1689811200&v=beta&t=fZzPTJfSp7V0f96hnnCr3-KM5Yl-XUbb-zcK7YJcyd4","title":"Romain ZERBIB","subtitle":"Enseignant-chercheur HDR à l'ICD BS \/ Chercheur associé à la chaire ESSEC IMEO"}]},"updates":{"0":[{"time":"","text":"","likes_count":0,"comments_count":0},{"time":"11m","text":"🇫🇷 | 📆🥳 Le 16 mai 2013, l'ICD Business School célèbre les 50 ans de la Conférence des grandes écoles (CGE) ! Le 16 mai 1973 se réunissaient en Assemblée constitutive les 12 écoles fondatrices de la CGE. Au cours des 50 années qui ont suivi, plus de 200 autres les ont rejointes, dont l'ICD Business School. Durant ce demi-siècle, la Conférence des grandes écoles (CGE) n’a cessé d’œuvrer auprès des pouvoirs publics pour faire valoir les intérêts des Grandes écoles, développer des labels de formation à la qualité reconnue, et plus largement contribuer à la réflexion sur les évolutions majeures traversées par le monde de l’enseignement supérieur et de la recherche. Faroudja BOUCHENTOUF et toutes les équipes de l' ICD Business School souhaitent donc un très heureux 50e anniversaire à la Conférence des grandes écoles (CGE). Pour en savoir davantage, se rendre sur le site Web des 50 ans : https:\/\/50ans.cge.asso.fr\/ #ICD #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies","likes_count":2,"comments_count":0},{"time":"4d","text":"🇫🇷 | 📜🖼️ “C’est formidable de pouvoir accompagner un étudiant dans le développement de son projet professionnel, d’être l’une des personnes qui lui permettra d’accomplir ce projet et pouvoir l’encourager sur la voie de la réussite.” Aujourd'hui, nous mettons en lumière Camille Joy, Directeur Adjoint de la filière Banque-Assurance-Conseil à l'ICD Business School. 👉 https:\/\/bit.ly\/3AwGy5B 🇬🇧 | 📜🖼️ \"It's great to be able to accompany a student in the development of their professional project, to be one of the people who will allow them to accomplish this project and to be able to encourage them on their way to success. Today, we highlight Camille Joy, Deputy Director of the Banking-Insurance-Consulting programme at ICD Business School. 👉 https:\/\/bit.ly\/3NeBElh #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies #Pédagogie #Portrait","likes_count":89,"comments_count":14},{"time":"4d","text":"🎓 C’est avec émotion que le jeudi 13 avril 2023 nous avons célébré nos icédiens lors de la remise des diplômes des étudiants de l’ICD Toulouse au #StadeToulousain. Cette cérémonie a été l’occasion pour nous de partager la réussite de nos élèves et de valoriser leurs efforts et leur travail au cours de leur scolarité au sein de l’ICD de Toulouse. Encore un grand bravo à nos jeunes diplômés, nous vous souhaitons un bel avenir professionnel ! ✨ 📽 Retour en vidéo sur cet événement incontournable 👇 #icd #écoledecommerce #groupeigs #remisedesdiplômes #toulouse","likes_count":35,"comments_count":0},{"time":"4d","text":"🌍 Last week we welcomed Dr Lana Domsic, an Erasmus coordinator and an intercultural management teacher from the University of Applied Sciences Baltazar Zaprešić in Zagreb, Croatia Lana came to hold a workshop on cultural tourism to our MBA students. What does she think about us ? «The campus is beautifully designed and modern and the MBA class is very pleasant ! » « I want to teach the students to respect different cultures and to learn how to create an ethical business. » Thank you Lana for your time and goodwill you’ve shown to our students 🙏 #internationalteacher #croatia #teamicd #businessstudent #businessschool","likes_count":6,"comments_count":0},{"time":"6d","text":"🇫🇷 | 🎖️ Demi-finaliste du concours Les Négociales, Fatema Shaznan étudiante en Bachelor Business Development nous relate son #expérience lors de cette #compétition intense ayant réuni plus de 6000 participants. Découvrez son #interview ⤵️ 🇬🇧 | 🎖️ Semi-finalist of Les Négociales competition, Fatema Shaznan, a student in Bachelor Business Development, tells us about her experience during this intense #competition which gathered more than 6000 participants. #ICD #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies","likes_count":27,"comments_count":0},{"time":"6d","text":"🇫🇷 | Quel rôle joue la #musique dans le #comportement des consommateurs et dans le #marketing 3.0 ? “Concrètement aujourd’hui, quand on fait une annonce publicitaire, on doit penser à la musique que l’on doit y mettre, en fonction du message que l’on veut faire passer.” 🎶 Retrouvez l'#interview de Samuel Mayol, enseignant-chercheur et #directeur adjoint du LaRA à l’ICD Business School sur Xerfi Canal. Une #interview menée par Jean-Philippe Denis. 🎵⤵️ 🇬🇧 | What role does #music play in #consumer #behavior and in marketing 3.0? \"Concretely today, when we make an advert, we have to think about the music we have to put in it, according to the message we want to put across.\" 🎶 Find the interview with Samuel Mayol, teacher-researcher and deputy #director of LaRA at ICD Business School on Xerfi Canal. An #interview conducted by Jean-Philippe Denis. 🎵⤵️ #ICD #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies","likes_count":22,"comments_count":0},{"time":"1w","text":"🇫🇷 | 🎓 La #remisedesdiplômes constitue un moment crucial pour les étudiants, symbolisant la fin d'une étape importante de leur vie et le début d'une nouvelle #aventure. Pour les étudiants de l'ICD Business School, faisant partie du GROUPE IGS, cette #cérémonie revêt une signification particulière en soulignant leur réussite et leur engagement envers l'#ExcellenceAcadémique. 👨🎓👩🎓 📸 Venez revivre en image cette cérémonie comme si vous y était 👉 https:\/\/bit.ly\/44vbb9r Pour en apprendre plus sur l’importance de la remise des diplômes pour un étudiant, découvez notre article 👉 https:\/\/bit.ly\/3ARXfIP Félicitations à tous nos diplômés, nous vous souhaitons un bel avenir professionnel ! Crédits photos : ©Matthieu Suprin, ©Nicko Guihal, ©Jean Baptiste Drouilly Stéphane de MIOLLIS Eric OUAKNINE Léonor Siney Pascale VALETTE Gaelle MEALLIER Laureline Plaisant Faroudja BOUCHENTOUF Camille Joy 🇬🇧 | 🎓 Graduation is a crucial moment for students, symbolizing the end of an important stage in their lives and the beginning of a new adventure. For the students of ICD Business School, part of the GROUPE IGS, this ceremony takes on a special meaning by highlighting their achievement and commitment to academic excellence. 👨🎓👩🎓 📸 Come and relive this ceremony in pictures as if you were there 👉 https:\/\/bit.ly\/44vbb9r To learn more about the importance of graduation for a student, check out our article 👉 https:\/\/bit.ly\/3LTUMUN Congratulations to all our graduating classes, we wish you a bright professional future! #ICD #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies #GroupeIGS #Graduate #WeLoveGroupeIGS #RDD #RDD2023 #Cérémonie #Diplôme","likes_count":143,"comments_count":0},{"time":"1w","text":"#focus sur les « Nouvelles formes d’entreprises responsables », un module de cours enseigné par Victor Combes auprès des étudiants du Master Programme Grande Ecole de l’ICD BUSINESS SCHOOL TOULOUSE. 👉L’objectif principal de ce cours est de rendre possible la pensée d’organisations alternatives. Grâce à différents axes de travail, Victor a mené les apprenants à une réflexion poussée sur la déconstruction de l’entreprise traditionnelle. C'est au moyen d'une étude de cas 📝mettant en évidence les limites d’une emprise actionnariale et l'analyse des « utopies réelles » que les étudiants ont pu se plonger dans une approche concrète de cette thématique innovante. Merci à Annick VALETTE, vice-présidente de la MAIF, pour son intervention lors du dernier cours, sa confiance et son authenticité, très appréciée par les étudiants. 👏 Grâce à cet échange, les élèves ont pu bénéficier d’un retour d’expérience de la MAIF, et ont pu confronter leur compréhension de ces types d’entreprises. L’expérience continue, avec Kévin PASTIER, PhD, qui prend le relais de ce cours auprès des étudiants de l’ICD Paris ! 📚 #ecoledecommerce #icd #entreprise #alternative #experience #programmegrandeecole","likes_count":45,"comments_count":0},{"time":"1w","text":"Portrait🖼️ | Découvrons les métiers et les parcours des femmes et des hommes qui contribuent à la richesse de l'ICD Business School, à travers des interviews sur mesure. Aujourd'hui, nous vous présentons Amel FREIFER, assistante pédagogique du Programme Grande École 1er cycle et du Bachelor Digital et Stratégie d’Entreprise, ainsi qu'Anne-Charlotte OLCZYK, responsable formation du Programme Grande École 1er cycle. #ICDParis #BusinessSchool #EcoleDeCommerce #BusinessStudies #Pédagogie","likes_count":38,"comments_count":4}]},"show_more":{"0":[]},"affiliated":{"0":[{"title":"GROUPE IGS, Higher Education Group","subtitle":"Higher Education","location":null,"Links":"https:\/\/fr.linkedin.com\/company\/groupe-igs?trk=affiliated-pages"}]},"browse_jobs":{"0":[]},"company_id":{"0":null},"timestamp":{"0":"2023-05-16T12:19:51.032Z"},"slogan":{"0":"Les générations évoluent vite, l'ICD aussi !"},"crunchbase_url":{"0":null},"stock_info":{"0":null},"funding":{"0":null},"investors":{"0":null},"similarPages":{"0":[{"name":"Jobs et offres d'emploi","pageUrl":"https:\/\/ma.linkedin.com\/company\/4recruteee?trk=similar-pages","activity":"Human Resources Services","location":"Kenitra, Rabat - Salé - Kénitra"},{"name":"AMS sécurité","pageUrl":"https:\/\/ch.linkedin.com\/company\/ams-s%C3%A9curit%C3%A9?trk=similar-pages","activity":"Security and Investigations","location":"Saint-Gingolph, Valais"},{"name":"Éditions Management & Innovation","pageUrl":"https:\/\/fr.linkedin.com\/company\/%C3%A9ditions-management-innovation?trk=similar-pages","activity":"Research Services","location":""},{"name":"Euridis Sales Academy","pageUrl":"https:\/\/fr.linkedin.com\/company\/euridis-sales-academy?trk=similar-pages","activity":"Professional Training and Coaching","location":"Paris, Île-de-France"},{"name":"VTech Electronics France","pageUrl":"https:\/\/fr.linkedin.com\/company\/vtech-france?trk=similar-pages","activity":"Computer Games","location":""},{"name":"GarderMesEnfants","pageUrl":"https:\/\/fr.linkedin.com\/company\/gardermesenfants?trk=similar-pages","activity":"Individual and Family Services","location":"Marseille, BDR"},{"name":"JPG","pageUrl":"https:\/\/fr.linkedin.com\/company\/jpg-fournitures-mobilier-bureau?trk=similar-pages","activity":"Retail Office Equipment","location":"Survilliers, Île-de-France"},{"name":"Laboratoire Therascience","pageUrl":"https:\/\/fr.linkedin.com\/company\/laboratoire-therascience?trk=similar-pages","activity":"Wellness and Fitness Services","location":""},{"name":"Laboratoires Novexpert","pageUrl":"https:\/\/fr.linkedin.com\/company\/laboratoiresnovexpert?trk=similar-pages","activity":"Personal Care Product Manufacturing","location":""},{"name":"NATUROPERA","pageUrl":"https:\/\/fr.linkedin.com\/company\/tidoo?trk=similar-pages","activity":"Manufacturing","location":"Boulogne Billancourt, France"}]},"Website":{"0":"http:\/\/www.icd-ecoles.com\/"},"Industries":{"0":"Higher Education"},"Company size":{"0":"51-200 employees"},"Headquarters":{"0":"Paris et Toulouse, IDF et Occitanie"},"Type":{"0":"Educational"},"Specialties":{"0":"Marketing, Commerce, Business Development, Evènementiel, communication, business, data, banque, assurance, and management"}}